app/controllers/sessions_controller.rb

  def create
    user = User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]