app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "razak"], ["email", "njigouhrazak@iut-dhaka.edu"], ["created_at", "2020-07-02 10:32:48.332897"], ["updated_at", "2020-07-02 10:32:48.332897"]]